CDiamondGit/stm32SpaceInvaders/src/main.c
/*
 * 1. INCLUDES & DEFINES
 *
 */
#include <stdbool.h>
#include <stm32f031x6.h>
#include "display.h"
#include "musical_notes.h"
#include "serial.h"
#include "sound_effects.h"

/* --- Screen --------------------------------------------------------------- */
#define SCREEN_W 128
#define SCREEN_H 160

/* --- Ship ----------------------------------------------------------------- */
#define SHIP_W 12
#define SHIP_H 12
#define SHIP_MIN_X 2
#define SHIP_MAX_X (SCREEN_W - SHIP_W - 2)
#define SHIP_SPEED 2

/* --- Bullet --------------------------------------------------------------- */
#define BULLET_W 2
#define BULLET_H 2
#define BULLET_OFFSET_X 6
#define BULLET_OFFSET_Y 13
#define BULLET_SPEED 4
#define ALIEN_BULLET_SPEED 1
#define BULLET_COLOR 65287
#define ALIEN_BULLET_COLOR 57034

/* --- Alien grid ----------------------------------------------------------- */
#define ALIEN_W 11
#define ALIEN_H 8
#define ALIEN_ROWS 3
#define ALIEN_COLS 5
#define ALIEN_GAP_X 11    /* horizontal gap between aliens          */
#define ALIEN_GAP_Y 5     /* vertical gap between aliens            */
#define ALIEN_ORIGIN_X 12 /* grid left edge at game start           */
#define ALIEN_ORIGIN_Y 20 /* grid top  edge at game start           */

#define ALIEN_GRID_W \
  (ALIEN_COLS * (ALIEN_W + ALIEN_GAP_X) - ALIEN_GAP_X) /* 75 */
#define ALIEN_GRID_H \
  (ALIEN_ROWS * (ALIEN_H + ALIEN_GAP_Y) - ALIEN_GAP_Y) /* 34 */

/* Movement bounds for the grid origin (left edge of col-0) */
#define ALIEN_MIN_X 2
#define ALIEN_MAX_X (SCREEN_W - ALIEN_GRID_W - 2)

/* How many pixels the grid shifts per move tick, and ms between ticks */
#define ALIEN_STEP 5
#define ALIEN_MOVE_MS \
  1000 /* decrease speeds up alien and increase to slow down          */

/* Drop distance when hitting a wall (one alien row + gap) */
#define ALIEN_DROP (ALIEN_H + ALIEN_GAP_Y)

/* --- HUD ------------------------------------------------------------------ */
#define HUD_LINE_Y 144
#define HUD_LINE_COLOR 57351

#define ALIEN_FIRE_MIN_MS 800
#define ALIEN_FIRE_MAX_MS 3000

/*
 * 2. structs & ENUMS
 */
typedef enum { BULLET_READY, BULLET_FIRE } BulletState;

typedef struct {
  uint16_t x, y;
  uint16_t oldX, oldY;
} Transform;

typedef struct {
  Transform coords;
  uint16_t speed;
} Ship;

typedef struct {
  Transform coords;
  BulletState state;
  uint16_t speed;
} Bullet;

/*
 * AlienGrid holds everything about the alien formation.
 *
 * offsetX / offsetY   – current top-left origin of the whole grid
 * oldOffsetX/Y        – origin last frame (used by dirty-strip render)
 * dirX                – +1 moving right, -1 moving left
 * lastMoveTime        – timestamp of last move tick
 * status[][]          – 0 = alive, 1 = dead
 * basePosX/Y[]        – per-column / per-row pixel offsets RELATIVE to origin
 *                        (precomputed once, never change)
 */
typedef struct {
  int16_t offsetX, offsetY;
  int16_t oldOffsetX, oldOffsetY;
  int8_t dirX;
  uint32_t lastMoveTime;
  uint8_t status[ALIEN_ROWS][ALIEN_COLS];
  uint16_t basePosX[ALIEN_COLS]; /* relative X per column */
  uint16_t basePosY[ALIEN_ROWS]; /* relative Y per row    */
  int8_t earToggle;
  Bullet ab[ALIEN_COLS];
  uint32_t nextFireTime[ALIEN_COLS];
} AlienGrid;

typedef struct {
  Ship ship;
  Bullet bullet;
  AlienGrid aliens;
  int lives;
} GameState;

/* --- Temporary location for sound code until main.c is cleaned up --------- */
volatile const uint32_t* current_tune_notes = 0;
volatile const uint32_t* current_tune_times = 0;
volatile uint32_t current_tune_note_count = 0;
volatile uint32_t current_repeat_tune = 0;
volatile uint32_t current_note_index = 0;
volatile int32_t current_note_timer = 0;
volatile uint32_t milliseconds = 0;

const uint32_t shoot_notes[] = {C4, A3, C4};
const uint32_t shoot_times[] = {60, 80, 60};
const uint32_t shoot_note_count = 3;

const uint32_t explode_notes[] = {F4, D4, C4, A3, F3, D3, C3, A2, F2, D2, C2};
const uint32_t explode_times[] = {25, 25, 30, 30, 35, 40, 40, 45, 45, 50, 60};
const uint32_t explode_note_count = 11;

void start_sound_effect(const uint32_t notes[],
                        const uint32_t times[],
                        uint32_t count,
                        uint32_t repeat) {
  if (count == 0) {
    return;
  }
  __disable_irq();
  current_tune_notes = notes;
  current_tune_times = times;
  current_tune_note_count = count;
  current_repeat_tune = repeat;
  current_note_index = 0;
  current_note_timer = current_tune_times[0];

  playNote(current_tune_notes[0]);
  __enable_irq();
}

void SysTick_Handler(void) {
  milliseconds++;

  if (current_tune_notes != 0) {
    if (current_note_timer > 0) {
      current_note_timer--;
    }

    if (current_note_timer == 0) {
      current_note_index++;

      if (current_note_index >= current_tune_note_count) {
        if (current_repeat_tune == 0) {
          current_tune_notes = 0;
          current_tune_times = 0;
          current_tune_note_count = 0;
          current_note_index = 0;
          current_note_timer = 0;
          stopSound();
          return;
        } else {
          current_note_index = 0;
        }
      }

      current_note_timer = current_tune_times[current_note_index];
      playNote(current_tune_notes[current_note_index]);
    }
  }
}

/*
 * 3. GLOBALS & SPRITES
 */
static uint32_t lastUpdate = 0;
static const uint32_t FRAME_DELAY = 16; /* ~60 fps */

static GameState gs;
static uint32_t randState; /* xorshift32 seed   */

static const uint16_t spaceShip[] = {
    0,     0,     0,     0,     0,     34882, 34882, 0,     0,     0,     0,
    0,     0,     0,     0,     0,     34882, 37012, 37012, 54701, 0,     0,
    0,     0,     0,     0,     0,     0,     12692, 33585, 33585, 28820, 0,
    0,     0,     0,     0,     0,     0,     9521,  41769, 61181, 61181, 41769,
    42818, 0,     0,     0,     0,     0,     0,     10058, 49961, 18138, 18138,
    41769, 52595, 0,     0,     0,     0,     0,     21933, 52067, 49961, 18138,
    18138, 49961, 28292, 21933, 0,     0,     63414, 28820, 49961, 28027, 41769,
    41769, 41769, 41769, 19299, 41769, 37012, 63670, 35154, 37012, 49961, 28027,
    28820, 37012, 37012, 37012, 19299, 41769, 37012, 35154, 0,     35154, 41769,
    27755, 37012, 35154, 35154, 37012, 28292, 41769, 35154, 0,     0,     0,
    34361, 34361, 34369, 47302, 47302, 34882, 34361, 34361, 0,     0,     0,
    0,     0,     0,     34369, 34882, 33577, 34882, 0,     0,     0,     0,
    0,     0,     0,     0,     0,     45196, 21933, 0,     0,     0,     0,
    0,
};

static const uint16_t blueAlienBoth[][88] = {
    {0,     0,     41187, 0,     0,     0,     0,     0,     41187, 0,
     0,     41187, 0,     0,     41187, 0,     0,     0,     41187, 0,
     0,     41187, 41187, 0,     41187, 41187, 41187, 41187, 41187, 41187,
     41187, 0,     41187, 41187, 41187, 41187, 0,     41187, 41187, 41187,
     0,     41187, 41187, 41187, 41187, 41187, 41187, 41187, 41187, 41187,
     41187, 41187, 41187, 41187, 41187, 0,     41187, 41187, 41187, 41187,
     41187, 41187, 41187, 41187, 41187, 0,     0,     0,     41187, 0,
     0,     0,     0,     0,     41187, 0,     0,     0,     41187, 0,
     0,     0,     0,     0,     0,     0,     41187, 0},
    {0,     0,     41187, 0,     0,     0,     0,     0,     41187, 0,
     0,     0,     0,     0,     41187, 0,     0,     0,     41187, 0,
     0,     0,     0,     0,     41187, 41187, 41187, 41187, 41187, 41187,
     41187, 0,     0,     0,     41187, 41187, 0,     41187, 41187, 41187,
     0,     41187, 41187, 0,     41187, 41187, 41187, 41187, 41187, 41187,
     41187, 41187, 41187, 41187, 41187, 41187, 0,     41187, 41187, 41187,
     41187, 41187, 41187, 41187, 0,     41187, 41187, 0,     41187, 0,
     0,     0,     0,     0,     41187, 0,     41187, 0,     0,     0,
     41187, 41187, 0,     41187, 41187, 0,     0,     0}};

static const uint16_t redAlien[][88] = {
    {
        0,     0,     65320, 0,     0,     0,     0,     0,     65320, 0,
        0,     0,     0,     0,     65320, 0,     0,     0,     65320, 0,
        0,     0,     0,     0,     65320, 65320, 65320, 65320, 65320, 65320,
        65320, 0,     0,     0,     65320, 65320, 0,     65320, 65320, 65320,
        0,     65320, 65320, 0,     65320, 65320, 65320, 65320, 65320, 65320,
        65320, 65320, 65320, 65320, 65320, 65320, 0,     65320, 65320, 65320,
        65320, 65320, 65320, 65320, 0,     65320, 65320, 0,     65320, 0,
        0,     0,     0,     0,     65320, 0,     65320, 0,     0,     0,
        65320, 65320, 0,     65320, 65320, 0,     0,     0,
    },
    {
        0,     0,     65320, 0,     0,     0,     0,     0,     65320, 0,
        0,     65320, 0,     0,     65320, 0,     0,     0,     65320, 0,
        0,     65320, 65320, 0,     65320, 65320, 65320, 65320, 65320, 65320,
        65320, 0,     65320, 65320, 65320, 65320, 0,     65320, 65320, 65320,
        0,     65320, 65320, 65320, 65320, 65320, 65320, 65320, 65320, 65320,
        65320, 65320, 65320, 65320, 65320, 0,     65320, 65320, 65320, 65320,
        65320, 65320, 65320, 65320, 65320, 0,     0,     0,     65320, 0,
        0,     0,     0,     0,     65320, 0,     0,     0,     65320, 0,
        0,     0,     0,     0,     0,     0,     65320, 0,
    }};

static const uint16_t greenAlien[][88] = {
    {0,     0,     51975, 0,     0,     0,     0,     0,     51975, 0,
     0,     51975, 0,     0,     51975, 0,     0,     0,     51975, 0,
     0,     51975, 51975, 0,     51975, 51975, 51975, 51975, 51975, 51975,
     51975, 0,     51975, 51975, 51975, 51975, 0,     51975, 51975, 51975,
     0,     51975, 51975, 51975, 51975, 51975, 51975, 51975, 51975, 51975,
     51975, 51975, 51975, 51975, 51975, 0,     51975, 51975, 51975, 51975,
     51975, 51975, 51975, 51975, 51975, 0,     0,     0,     51975, 0,
     0,     0,     0,     0,     51975, 0,     0,     0,     51975, 0,
     0,     0,     0,     0,     0,     0,     51975, 0},
    {
        0,     0,     51975, 0,     0,     0,     0,     0,     51975, 0,
        0,     0,     0,     0,     51975, 0,     0,     0,     51975, 0,
        0,     0,     0,     0,     51975, 51975, 51975, 51975, 51975, 51975,
        51975, 0,     0,     0,     51975, 51975, 0,     51975, 51975, 51975,
        0,     51975, 51975, 0,     51975, 51975, 51975, 51975, 51975, 51975,
        51975, 51975, 51975, 51975, 51975, 51975, 0,     51975, 51975, 51975,
        51975, 51975, 51975, 51975, 0,     51975, 51975, 0,     51975, 0,
        0,     0,     0,     0,     51975, 0,     51975, 0,     0,     0,
        51975, 51975, 0,     51975, 51975, 0,     0,     0,
    }};

