CDiamondGit/stm32SpaceInvaders/src/main.c
static const uint16_t explosion[88] = {
    0,    0,     0,     0,     0,     0,     21809, 2105,  1073,  2105,  0,
    2105, 61747, 53562, 21809, 53562, 61747, 15139, 15139, 2105,  2105,  2105,
    0,    1073,  21809, 32158, 15139, 64354, 24375, 7013,  24375, 2105,  2105,
    0,    15139, 7013,  15139, 24375, 32158, 24375, 7013,  64354, 53562, 0,
    0,    61747, 7013,  7013,  24375, 24375, 24375, 15139, 7013,  53562, 0,
    0,    15139, 15139, 21809, 15139, 15139, 7013,  7013,  21809, 11313, 0,
    0,    0,     0,     7013,  61747, 7013,  32158, 64354, 11313, 0,     0,
    0,    0,     0,     53562, 1073,  21809, 61747, 2105,  0,     0,     0};

/*
 * 4. STM32 HARDWARE SETUP
 *
 */

void pinMode(GPIO_TypeDef* port, uint32_t pin, uint32_t mode) {
  uint32_t val = port->MODER;
  val &= ~(3u << (pin * 2));
  val |= (mode << (pin * 2));
  port->MODER = val;
}

static void enablePullUp(GPIO_TypeDef* port, uint32_t pin) {
  port->PUPDR &= ~(3u << (pin * 2));
  port->PUPDR |= (1u << (pin * 2));
}

static void initClock(void) {
  RCC->CR &= ~(1u << 24);
  while (RCC->CR & (1 << 25))
    ;

  FLASH->ACR |= (1 << 0); /* 1 wait-state     */
  FLASH->ACR &= ~((1u << 2) | (1u << 1));
  FLASH->ACR |= (1 << 4); /* prefetch on      */

  RCC->CFGR &= ~((1u << 21) | (1u << 20) | (1u << 19) |
                 (1u << 18)); /* PLL x12 -> 48MHz */
  RCC->CFGR |= ((1 << 21) | (1 << 19));
  RCC->CFGR |= (1 << 14); /* ADC /4           */
  RCC->CR |= (1 << 24);   /* PLL on           */
  RCC->CFGR |= (1 << 1);  /* PLL as sysclk    */
}

static void initSysTick(void) {
  SysTick->LOAD = 48000;
  SysTick->CTRL = 7;
  SysTick->VAL = 10;
  __asm(" cpsie i ");
}

static void setupIO(void) {
  RCC->AHBENR |= (1 << 18) | (1 << 17);
  display_begin();
  pinMode(GPIOB, 4, 0);
  enablePullUp(GPIOB, 4); /* right – PB4  */
  pinMode(GPIOB, 5, 0);
  enablePullUp(GPIOB, 5); /* left  – PB5  */
  pinMode(GPIOA, 8, 0);
  enablePullUp(GPIOA, 8); /* fire  – PA8  */
  pinMode(GPIOA, 11, 0);
  enablePullUp(GPIOA, 11); /* down  – PA11 */
}

void delay(volatile uint32_t ms) {
  uint32_t end = ms + milliseconds;
  while (milliseconds != end)
    __asm(" wfi ");
}

uint32_t xorshift32() {
  randState ^= randState << 13;
  randState ^= randState >> 17;
  randState ^= randState << 5;
  return randState;
}

static uint8_t shouldFire(uint8_t threshold) {
  return (xorshift32() % threshold) ==
         0;  // threshold => more higher less likely to fire
  /*
  threshold = 3:
  possible results of % 3 → { 0, 1, 2 }
  only 0 returns 1 → 1 in 3 chance = 33%
  */
}

static uint32_t randomFireDelay(void) {
  uint32_t range = ALIEN_FIRE_MAX_MS - ALIEN_FIRE_MIN_MS;
  return ALIEN_FIRE_MIN_MS + (xorshift32() % range);
}

uint8_t get_random_bit(uint32_t* state) {
  return xorshift32(state) & 1;
}

int isInside(uint16_t x1,
             uint16_t y1,
             uint16_t w,
             uint16_t h,
             uint16_t px,
             uint16_t py) {
  return (px >= x1 && px <= x1 + w && py >= y1 && py <= y1 + h) ? 1 : 0;
}

/*
 * 5. GAME INIT
 *
 */

static void parkAlienBullet(int col) {
  AlienGrid* ag = &gs.aliens;
  Bullet* b = &ag->ab[col];

  // find the bottom alive alien in the column

  int row = -1;
  for (int i = ALIEN_ROWS - 1; i >= 0; i--) {
    if (ag->status[i][col] == 0) {
      row = i;
      break;
    }
  }

  // no
  if (row == -1) {
    b->state = BULLET_READY;
    return;
  }

  b->coords.x = b->coords.y =
      (uint16_t)(ag->offsetX + ag->basePosX[col] + BULLET_OFFSET_X);
  b->coords.y = b->coords.oldY =
      (uint16_t)(ag->offsetY + ag->basePosY[row] + ALIEN_H);

  b->speed = ALIEN_BULLET_SPEED;
  b->state = BULLET_READY;
}

static void initAlienGrid() {
  AlienGrid* ag = &gs.aliens;
  ag->offsetX = ag->oldOffsetX = ALIEN_ORIGIN_X;
  ag->offsetY = ag->oldOffsetY = ALIEN_ORIGIN_Y;
  ag->dirX = -1; /* start moving right */
  ag->earToggle = 0;
  ag->lastMoveTime = 0;

  /* Precompute relative per-cell offsets (never change during play) */
  for (int i = 0; i < ALIEN_ROWS; i++)
    ag->basePosY[i] = (uint16_t)(i * (ALIEN_H + ALIEN_GAP_Y));
  for (int j = 0; j < ALIEN_COLS; j++)
    ag->basePosX[j] = (uint16_t)(j * (ALIEN_W + ALIEN_GAP_X));

  // putImage((uint16_t)(ag->offsetX + ag->basePosX[j]),
  //                (uint16_t)(ag->offsetY + ag->basePosY[i]), ALIEN_W, ALIEN_H,
  //                redAlien[ag->earToggle], 1, 0);

  /* All aliens alive */
  for (int i = 0; i < ALIEN_ROWS; i++)
    for (int j = 0; j < ALIEN_COLS; j++)
      ag->status[i][j] = 0;

  for (int i = 0; i < ALIEN_COLS; i++) {
    parkAlienBullet(i);
    ag->nextFireTime[i] = milliseconds + randomFireDelay();
  }
}

static void initGameState(void) {
  randState = milliseconds;

  gs.lives = 3;

  /* Ship */
  gs.ship.coords.x = gs.ship.coords.oldX = 58;
  gs.ship.coords.y = gs.ship.coords.oldY = 130;
  gs.ship.speed = SHIP_SPEED;

  /* Bullet – parked at muzzle */
  gs.bullet.coords.x = gs.bullet.coords.oldX =
      gs.ship.coords.x + BULLET_OFFSET_X;
  gs.bullet.coords.y = gs.bullet.coords.oldY =
      gs.ship.coords.y - BULLET_OFFSET_Y;
  gs.bullet.speed = BULLET_SPEED;
  gs.bullet.state = BULLET_READY;

  /* Alien grid */

  initAlienGrid();
}

/*
 * 6. INPUT
 *
 */
static void handleInput(void) {
  /* Right – PB4 */
  if ((GPIOB->IDR & (1 << 4)) == 0) {
    if (gs.ship.coords.x < SHIP_MAX_X)
      gs.ship.coords.x += gs.ship.speed;
  }

  /* Left – PB5 */
  if ((GPIOB->IDR & (1 << 5)) == 0) {
    if (gs.ship.coords.x > SHIP_MIN_X)
      gs.ship.coords.x -= gs.ship.speed;
  }

  /* Fire – PA8 */
  if ((GPIOA->IDR & (1 << 8)) == 0) {
    if (gs.bullet.state == BULLET_READY) {
      gs.bullet.state = BULLET_FIRE;
      start_sound_effect(shoot_notes, shoot_times, shoot_note_count, 0);
    }
  }
}

/*
 * 7. ALIEN MOVEMENT
 *
 */

/*
 *@isAlienGridMt(void)
 *returns 1 if none of the alien is alive, else 0
 */

static int isAlienGridMt(void) {
  AlienGrid* ag = &gs.aliens;
  for (int i = 0; i < ALIEN_ROWS; i++) {
    for (int j = 0; j < ALIEN_COLS; j++) {
      if (ag->status[i][j] == 0) {
        return 0;
      }
    }
  }
  return 1;
}

